RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_lcd.c
  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 11)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure MuxCOM6 to be COM6 or SEGx.
 * @param Sel: Specify the MuxSEG.
 *   This parameter can be one of the following values:
 *     @arg LCD_MUXCOM7_IS_COM6  :
 *     @arg LCD_MUXCOM7_IS_SEGx  :(52341: SEG27, 57352: SEG35)
 * @retval None
 ************************************************************************************************************/
void LCD_MuxCOM6Config(LCD_MUXCOM6_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 10)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure MuxCOM5 to be COM5 or SEGx.
 * @param Sel: Specify the MuxSEG.
 *   This parameter can be one of the following values:
 *     @arg LCD_MUXCOM7_IS_COM5  :
 *     @arg LCD_MUXCOM7_IS_SEGx  :(52341: SEG26, 57352: SEG34)
 * @retval None
 ************************************************************************************************************/
void LCD_MuxCOM5Config(LCD_MUXCOM5_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 9)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure MuxCOM4 to be COM4 or SEGx.
 * @param Sel: Specify the MuxSEG.
 *   This parameter can be one of the following values:
 *     @arg LCD_MUXCOM7_IS_COM4  :
 *     @arg LCD_MUXCOM7_IS_SEGx  :(52341: SEG25, 57352: SEG33)
 * @retval None
 ************************************************************************************************************/
void LCD_MuxCOM4Config(LCD_MUXCOM4_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 8)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD waveform type.
 * @param Sel: specify the LCD waveform type.
 *   This parameter can be one of the following values:
 *     @arg LCD_Type_A_Waveform : Type A waveform
 *     @arg LCD_Type_B_Waveform : Type B waveform
 * @retval None
 ************************************************************************************************************/
void LCD_WaveformConfig(LCD_Waveform_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 7)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure LCD Bias Selector.
 * @param Sel: Specify LCD Bias Selector.
 *   This parameter can be one of the following values:
 *     @arg LCD_Bias_1_4    : Bias 1/4
 *     @arg LCD_Bias_1_2    : Bias 1/2
 *     @arg LCD_Bias_1_3    : Bias 1/3
 *     @arg LCD_Bias_Static : STATIC
 * @retval None
 ************************************************************************************************************/
void LCD_BiasConfig(LCD_Bias_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(3ul << 5)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Duty Selection.
 * @param Sel: Specify LCD Duty select.
 *   This parameter can be one of the following values:
 *     @arg LCD_Duty_Static : Static duty
 *     @arg LCD_Duty_1_2    : 1/2 duty
 *     @arg LCD_Duty_1_3    : 1/3 duty
 *     @arg LCD_Duty_1_4    : 1/4 duty
 *     @arg LCD_Duty_1_6    : 1/6 duty
 *     @arg LCD_Duty_1_8    : 1/8 duty
 ************************************************************************************************************/
void LCD_DutyConfig(LCD_Duty_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(7ul << 2)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Power Selection.
 * @param Sel: Specify LCD Power select.
 *   This parameter can be one of the following values:
 *     @arg LCD_VoltageSource_External : External VLCD
 *     @arg LCD_VoltageSource_Internal : Internal charge pump
 * @retval None
 ************************************************************************************************************/
void LCD_VoltageSourceConfig(LCD_VoltageSource_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  HT_LCD->CR = (HT_LCD->CR & ~(1ul << 1)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LCD peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void LCD_Cmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_LCD->CR |= (1ul << 0);
  }
  else
  {
    HT_LCD->CR &= ~(1ul << 0);
  }
}

