RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_lcd.c
/*********************************************************************************************************//**
 * @brief Configure the LCD 16-bit prescaler.
 * @param Sel: specify the LCD 16-bit prescaler setting.
 *   This parameter can be one of the following values:
 *     @arg LCD_Prescaler_1     : CK_PS = CK_LCD / 1
 *     @arg LCD_Prescaler_2     : CK_PS = CK_LCD / 2
 *     @arg LCD_Prescaler_4     : CK_PS = CK_LCD / 4
 *     @arg LCD_Prescaler_8     : CK_PS = CK_LCD / 8
 *     @arg LCD_Prescaler_16    : CK_PS = CK_LCD / 16
 *     @arg LCD_Prescaler_32    : CK_PS = CK_LCD / 32
 *     @arg LCD_Prescaler_64    : CK_PS = CK_LCD / 64
 *     @arg LCD_Prescaler_128   : CK_PS = CK_LCD / 128
 *     @arg LCD_Prescaler_256   : CK_PS = CK_LCD / 256
 *     @arg LCD_Prescaler_512   : CK_PS = CK_LCD / 512
 *     @arg LCD_Prescaler_1024  : CK_PS = CK_LCD / 1024
 *     @arg LCD_Prescaler_2048  : CK_PS = CK_LCD / 2048
 *     @arg LCD_Prescaler_4096  : CK_PS = CK_LCD / 4096
 *     @arg LCD_Prescaler_8192  : CK_PS = CK_LCD / 8192
 *     @arg LCD_Prescaler_16384 : CK_PS = CK_LCD / 16384
 *     @arg LCD_Prescaler_32768 : CK_PS = CK_LCD / 32768
 * @retval None
 ************************************************************************************************************/
void LCD_PrescalerConfig(LCD_Prescaler_Enum Sel)
{
  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF) == SET);
  HT_LCD->FCR = (HT_LCD->FCR & ~(15ul << 22)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD clock divider.
 * @param Sel: specify the LCD clock divider setting.
 *   This parameter can be one of the following values:
 *     @arg LCD_Divider_16 : CK_DIV = CK_PS / 16
 *     @arg LCD_Divider_17 : CK_DIV = CK_PS / 17
 *     @arg LCD_Divider_18 : CK_DIV = CK_PS / 18
 *     @arg LCD_Divider_19 : CK_DIV = CK_PS / 19
 *     @arg LCD_Divider_20 : CK_DIV = CK_PS / 20
 *     @arg LCD_Divider_21 : CK_DIV = CK_PS / 21
 *     @arg LCD_Divider_22 : CK_DIV = CK_PS / 22
 *     @arg LCD_Divider_23 : CK_DIV = CK_PS / 23
 *     @arg LCD_Divider_24 : CK_DIV = CK_PS / 24
 *     @arg LCD_Divider_25 : CK_DIV = CK_PS / 25
 *     @arg LCD_Divider_26 : CK_DIV = CK_PS / 26
 *     @arg LCD_Divider_27 : CK_DIV = CK_PS / 27
 *     @arg LCD_Divider_28 : CK_DIV = CK_PS / 28
 *     @arg LCD_Divider_29 : CK_DIV = CK_PS / 29
 *     @arg LCD_Divider_30 : CK_DIV = CK_PS / 30
 *     @arg LCD_Divider_31 : CK_DIV = CK_PS / 31
 * @retval None
 ************************************************************************************************************/
void LCD_DividerConfig(LCD_Divider_Enum Sel)
{
  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF) == SET);
  HT_LCD->FCR = (HT_LCD->FCR & ~(15ul << 18)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Blink Mode Selection.
 * @param Sel: Specify LCD Blink Mode Selection.
 *   This parameter can be one of the following values:
 *     @arg LCD_BlinkMode_Off           : Blink inactive
 *     @arg LCD_BlinkMode_SEG0_COM0     : SEG0 on COM0 blink
 *     @arg LCD_BlinkMode_SEG0_AllCOM   : SEG0 on All COM blink
 *     @arg LCD_BlinkMode_AllSEG_AllCOM : All SEG on All COM blink
 ************************************************************************************************************/
void LCD_BlinkModeConfig(LCD_BlinkMode_Enum Sel)
{
  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF) == SET);
  HT_LCD->FCR = (HT_LCD->FCR & ~(3ul << 16)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Blink Frequency  Selection.
 * @param Sel: Specify LCD Blink Frequency  Selection.
 *   This parameter can be one of the following values:
 *     @arg LCD_BlinkFrequency_Div8    : Blink frequency = frame rate / 8
 *     @arg LCD_BlinkFrequency_Div16   : Blink frequency = frame rate / 16
 *     @arg LCD_BlinkFrequency_Div32   : Blink frequency = frame rate / 32
 *     @arg LCD_BlinkFrequency_Div64   : Blink frequency = frame rate / 64
 *     @arg LCD_BlinkFrequency_Div128  : Blink frequency = frame rate / 128
 *     @arg LCD_BlinkFrequency_Div256  : Blink frequency = frame rate / 256
 *     @arg LCD_BlinkFrequency_Div512  : Blink frequency = frame rate / 512
 *     @arg LCD_BlinkFrequency_Div1024 : Blink frequency = frame rate / 1024
 ************************************************************************************************************/
void LCD_BlinkFrequencyConfig(LCD_BlinkFrequency_Enum Sel)
{
  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF) == SET);
  HT_LCD->FCR = (HT_LCD->FCR & ~(7ul << 13)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Charge Pump Voltage Selection.
 * @param Sel: Specify LCD Charge Pump Voltage Selection.
 *   This parameter can be one of the following values:
 *     @arg LCD_ChargePump_2V65 : Charge pump voltage = 2.65 V
 *     @arg LCD_ChargePump_2V75 : Charge pump voltage = 2.75 V
 *     @arg LCD_ChargePump_2V85 : Charge pump voltage = 2.85 V
 *     @arg LCD_ChargePump_2V95 : Charge pump voltage = 2.95 V
 *     @arg LCD_ChargePump_3V10 : Charge pump voltage = 3.10 V
 *     @arg LCD_ChargePump_3V25 : Charge pump voltage = 3.25 V
 *     @arg LCD_ChargePump_3V40 : Charge pump voltage = 3.40 V
 *     @arg LCD_ChargePump_3V55 : Charge pump voltage = 3.55 V
 ************************************************************************************************************/
void LCD_ChargePumpConfig(LCD_ChargePump_Enum Sel)
{
  /* !!! NOTICE !!!
     Must wait until the LCDENS = 0 before change the LCD settings.
  */
  #if 0
  while (LCD_GetFlagStatus(LCD_FLAG_ENS) == 1);
  #endif

  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF));
  HT_LCD->FCR = (HT_LCD->FCR & ~(7ul << 10)) | Sel;
}

/*********************************************************************************************************//**
 * @brief Configure the LCD Dead Time Duration Selection.
 * @param Sel: Specify LCD Dead Time Duration Selection.
     This parameter can be one of the following values:
 *     @arg LCD_Deadtime_0 : No dead time
 *     @arg LCD_Deadtime_1 : Type A: 1/2 phase period; Type B: 1 phase period
 *     @arg LCD_Deadtime_2 : Type A: 2/2 phase period; Type B: 2 phase period
 *     @arg LCD_Deadtime_3 : Type A: 3/2 phase period; Type B: 3 phase period
 *     @arg LCD_Deadtime_4 : Type A: 4/2 phase period; Type B: 4 phase period
 *     @arg LCD_Deadtime_5 : Type A: 5/2 phase period; Type B: 5 phase period
 *     @arg LCD_Deadtime_6 : Type A: 6/2 phase period; Type B: 6 phase period
 *     @arg LCD_Deadtime_7 : Type A: 7/2 phase period; Type B: 7 phase period
 ************************************************************************************************************/
void LCD_DeadTimeConfig(LCD_DeadTime_Enum Sel)
{
  while (LCD_GetFlagStatus(LCD_FLAG_FCRSF) == SET);
  HT_LCD->FCR = (HT_LCD->FCR & ~(7ul << 7)) | Sel;
}

